Repository: li1s/Uveon-1
Catalog: Bash/optimization-tools/locale/*/termidesk.po
Languages: ru

source: Guest OS is Astra OK! (
ru: Гостевая ОС это Астра Линукс OK! (

source: Attention: Guest OS not Astra. Exit\n
ru: Внимание: Гостевая ОС не Астра Линукс. Выход\n

source: Guest OS running on VM OK! (
ru: Гостевая ОС запущена в ВМ OK! (

source: Attention: not VM. Exit
ru: Внимание: ВМ не определена. Выход

source: Attention: 2 to 4 CPUs recommended for best performance!\n
ru: Внимание: рекомендуется от 2 до 4 ЦПУ для лучшей производительности!\n

source: Current CPU: (
ru: Текущих ЦПУ: (

source: CPU for Astra Linux on Termidesk OK! (
ru: ЦПУ в Астра Линукс для Термидеск OK! (

source: Attention: 2 GB RAM or more recommended for Astra Linux on Termidesk!\n
ru: ВниманиеЖ 2 ГБ ОЗУ или более рекомендуется для Астра Линукс в Термидеск!\n

source: Current RAM is: (
ru: Текущее ОЗУ: (

source: RAM for Astra Linux on Termidesk OK! (
ru: ОЗУ в Астра Линукс для Термидеск OK! (

source: Attention: no NIC on Astra Linux!\n
ru: Внимание: нет сетевой карты в Астра Линукс!\n

source: NIC for Astra Linux on Termidesk OK! (%s)\n
ru: Сетевая карта в Астра Линукс для Термидеск OK! (%s)\n

source: DHCP for Astra Linux on Termidesk OK! (%s)\n
ru: Клиент DHCP активен в Астра Линукс OK! (%s)\n

source: DHCP not enabled\n
ru: DHCP клиент не настроен\n

source: Termidesk online repo configured OK!\n
ru: Интернет репозиторий Термидеск подключен OK!\n

source: Checking config for termidesk repo\n
ru: Проверка настроек репозитория Термидеск\n

source: Termidesk repo configured OK!\n
ru: Репозиторий Термидеск подключен OK!\n

source: Backingup themerc files OK!\n
ru: Резрвное копирование файла темы themerc OK!\n

source: Patching themerc files...\n
ru: Изменение файла темы themerc...\n

source: FLY desktop optimization finish OK!\n
ru: Оптимизация рабочего стола FLY завершена OK!\n

source: Attention: Backupdir not create. Exit\n
ru: Внимание: папка для резервного копирования не создана. Выход\n

source: Attention: %s.......not installed\n
ru: Внимание: %s.......не установлен\n

source: %s already installed.......OK!\n
ru: %s уже установлен.......OK!\n

source: Do you wish to install missing pakages? ([Y]/n):
ru: Вы хотите установить отсутствующие пакеты? ([Y]/n):

source: Install requirements packages\n
ru: Установка необходимых пакетов\n

source: Install %s\n
ru: Установка %s\n

source: Package %s was installed OK!\n
ru: Пакет %s был установлен OK!\n

source: Attention: package %s was not installed\n
ru: Внимание: пакет %s небыл установлен\n

source: Please answer yes or no.
ru: Пожалуйста, ответьте Да или Нет.

source: All requirements packages installed OK!\n
ru: Все требуемые пакеты установлены OK!\n

source: Attention: %s requirements packages not installed.\n
ru: Внимание: %s требуемых пакета не установлено.\n

source: %s requirements packages installed OK!\n
ru: %s требуемых пакета установлено OK!\n

source: %s not installed.......OK!\n
ru: %s не установлен.......OK!\n

source: Attention: %s is installed and may remove\n
ru: Внимание: %s установлен и может быть удален\n

source: Do you wish to remove %s pakages? ([Y]/n):
ru: Вы хотите удалить %s пакетов? ([Y]/n):

source: Remove selected packages\n
ru: Удаление выбранных пакетов\n

source: Remove %s\n
ru: Удаление %s\n

source: Package %s was removed OK!\n
ru: Пакет %s был удален OK!\n

source: Attention: package %s was not removed\n
ru: Внимание: пакет %s не удален\n

source: All selected packages remove or not installed OK!\n
ru: Все выбранные пакеты удалены или не установлены OK!\n

source: Attention: %s selected packages was not removed.\n
ru: Внимание: %s выбранных пакетов не удалено.\n

source: %s selected packages was removed OK!\n
ru: %s выбранных пакетов удалено OK!\n

source: %s service is running...\n
ru: %s служба запущена...\n

source: %s service not running OK!\n
ru: %s службы не запущена OK!\n

source: Do you wish to stop and disable %s services? ([Y]/n):
ru: Вы хотите остановить и отключить %s службы? ([Y]/n):

source: Stop running services\n
ru: Остановка запущенной службы\n

source: Stop %s\n
ru: Остановка %s\n

source: Service %s was stoppeded OK!\n
ru: Служба %s была остановлена OK!\n

source: Service %s was disabled OK!\n
ru: Служба %s была отключена OK!\n

source: Attention: service %s was not stopped and disabled\n
ru: Внимание: служба %s не остановлена и не отключена\n

source: All selected services was stopped OK!\n
ru: Все выбранные службы остановлены OK!\n

source: Attention: %s selected services was not stop and disabled.\n
ru: Внимание: %s выбранных служб не остановлены и не отключены.\n

source: %s selected services was stopped and disabled OK!\n
ru: %s выбранных службы остановлены и отключены OK!\n

source: Service auto upgrade was stoped OK!\n
ru: Служба автоматического обновления остановлена OK!\n

source: Auto upgrade service was disabled OK!\n
ru: Служба автоматического обновления отключена OK!\n

source: Attention: Auto upgrade service was not be stopped\n
ru: Внимание: служба автоматического обновления не отсановлена\n

source: Attention: %s not be stopped\n
ru: Внимание: %s не остановлена\n

source: About tools
ru: Об инструментах

source: Exit
ru: Выход

source: OPTIMIZATION FUNCTIONS
ru: ФУНКЦИИ ОПТИМИЗАЦИИ

source: Select function for optimization
ru: Выбор функций для оптимизации

source: Installing required packages
ru: Установка требуемых пакетов

source: Stop recommended services
ru: Остановка рекомендованных служб

source: Remove recommended packages
ru: Удаление рекомендованных пакетов

source: Deleting large files
ru: Удаление больших файлов

source: Cleaning up user logs
ru: Очистка логов пользователя

source: Cleaning up system logs
ru: Очистка логов системы

source: Cleaning web browsers
ru: Очистка кеша веб-браузера

source: Cleaning bash history
ru: Очистка истории команд в bash

source: Optimize fly desktop
ru: Оптимизация рабочего стола fly

source: Cleaning temp files
ru: Очистка временных папок

source: Cleaning apt cache
ru: Очистка кеша apt

source: Cleaning journal
ru: Очистка журнала системы

source: Optimize power button
ru: Оптимизация кнопки выключения

source: Install display resize script
ru: Установка скрипта масштабирвоания экрана

source: Stop auto upgrade
ru: Остановка службы автоматического обновления

source: No option was selected (user hit Cancel or unselected all options)
ru: Опции не выбраны (пользователь нажал 'Отмена' или не выбрал опции)

source: Termidesk preparation and optimization tools for Astra Linux
ru: Инструменты оптимизации и подготовки гостевой ОС Астра Линукс для Термидеск

source: Checking system requirements...\n
ru: Проверка параметров системы...\n

source: Checking packages requirements...\n
ru: Проверка требуемых пакетов...\n

source: Checking services...\n
ru: Проверка служб...\n

source: Checking packages for remove...\n
ru: Проверка пакетов для удаления...\n

source: Checking large files...\n
ru: Проверка больших файлов...\n

source: Cheking user log files...\n
ru: Проверка файлов логов пользователя...\n

source: Cheking system log files...\n
ru: Проверка файлов системных логов...\n

source: Cheking web browsers files...\n
ru: Проверка файлов веб-браузера...\n

source: Cheking bash history files...\n
ru: Проверка файла истории команд bash...\n

source: Optimize fly desktop...\n
ru: Оптимизация рабочего стола fly...\n

source: Cheking temp files...\n
ru: Проверка временных файлов...\n

source: Cheking apt cache...\n
ru: Проверка кеша apt...\n

source: Cheking journal...\n
ru: Проверка файла журнала...\n

source: Cheking power button file...\n
ru: Проверка настроек кнопки питания...\n

source: Install resize script...\n
ru: Установка скрипта масштабирвоания экрана...\n

source: Stop auto update...\n
ru: Остановка службы автообновления...\n

source: Unsupported item %s
ru: Неподдерживаемый выбор %s

source: You chose Cancel. Exit
ru: Вы выбрали 'Отмена'. Выход

source: You chose Exit
ru: Вы выбрали 'Выход'

source: Checks and actions report...\n
ru: Отчет по проверкам и действиям...\n

source: Report
ru: Отчет

source: | System check |\n
ru: | Проверка системы |\n

source: Virtualization for guest OS
ru: Гостевая ОС в ВМ

source: OS is $distro
ru: ОС Астра Линукс

source: CPU for guest OS
ru: ЦПУ для гостевой ОС

source: RAM for guest OS
ru: ОЗУ для гостевой ОС

source: NIC for guest OS
ru: NIC в гостевой ОС

source: DHCP for guest OS
ru: DHCP в гостевой ОС

source: Termidesk repo
ru: Репозиторий Термидеск

source: | Packages operation |\n
ru: | Операции с пакетами |\n

source: Install req pkgs
ru: Установка треб. пакетов

source: Remove selected pkgs
ru: Удаление выбранных пакетов

source: Remove apt cache
ru: Удаление кеша apt

source: | Ssservices operation |\n
ru: | Действия со службами |\n

source: Service stopped
ru: Остановка служб

source: Auto upgrade stopped
ru: Остановка автообновления

source: | Files operation |\n
ru: | Операции с файлами |\n

source: Cleaning user log files
ru: Очистка логов пользователя

source: Cleaning system log files
ru: Очистка системных логов

source: Cleaning system archive log files
ru: Очистка архивов логов

source: Cleaning browsers files
ru: Очитска файлов веб-браузера

source: Cleaning tmp files
ru: Очистка временных файлов

source: | Optimization |\n
ru: | Оптимизации |\n

source: FLY desktop
ru: Рабочий стол fly

source: Powerr button
ru: Кнопка питания

source: Install resize script
ru: Установка скрипта масштабирования

source: Clear %s\n
ru: Очистка %s\n

source: File %s was cleaned OK!\n
ru: Файл %s был очищен OK!\n

source: Attention: file %s was not cleaned\n
ru: Внимание: файл %s не очищен\n

source: Attention: %s not be clean\n
ru: Внимание: %s не был очищен\n

source: %s log files was cleaned OK!\n
ru: %s лог файлов были очищены OK!\n

source: Clear archive log files in var dir\n
ru: Очистка архивов с лог файлами в папаке var\n

source: %s archive log files was cleaned OK!\n
ru: %s архивов с лог файлами были очищены OK!\n

source: Clear local repo\n
ru: Локальный репозиторий очищен\n

source: Local repo was cleaned OK!\n
ru: Локальный репозиторий был очищен OK!\n

source: Clear journal\n
ru: Очистка журнала системы\n

source: Journal was cleaned OK!\n
ru: Журнал системы был очищен OK!\n

source: Clear tmp dirs\n
ru: Очистка временных файлов\n

source: TMP dirs was cleaned OK!\n
ru: Временные файлы были очищены OK!\n

source: Backingup power button files OK!\n
ru: Реервное копирование файла электропитания OK!\n

source: Patching power button files...\n
ru: Изменение файла электропитания...\n

source: Patching power button file OK!\n
ru: Изменение файла электропитания завершено OK!\n

source: Copy resize script to /usr/local/bin/ and create udev rule!\n
ru: Установка скрипта масштабирования экрана в /usr/local/bin/ и создание правила udev!\n

source: Resize script copied OK!\n
ru: Скрипт масштабирования экрана установлен OK!\n

source: Found large files:\n %s\n
ru: Найдены большие файлы:\n %s\n

source: Do you wish to delete all large files? ([Y]/n):
ru: Вы хотите удалить все большие файлы? ([Y]/n):

source: Delete all large files\n
ru: Удаление всех больших файлов\n

source: File %s has been deleted OK!\n
ru: Файл %s был удален OK!\n

source: Attention: file %s has not been deleted\n
ru: Внимание: файл %s не удален\n

source: No large files found!\n
ru: Большие файлы не найдены!\n

source: Attention: %s were not deleted\n
ru: Внимание: %s не удален\n

source: %s large files have been deleted OK!\n
ru: %s больших файлов удалено OK!\n

source: Clearing the log files in the user home directory\n
ru: Очистка лог файлов в директории пользователя\n

source: Clearing %s\n
ru: Очистка %s\n

source: %s file has been cleared OK!\n
ru: %s файл очищен OK!\n

source: Attention: %s file was not cleared\n
ru: Внимание: %s не очищен\n

source: Attention: %s user log files were not cleaned\n
ru: Внимание: %s лог файлов пользователя не очищены\n

source: %s files have been cleaned OK!\n
ru: %s файлов было очищено OK!\n

source: Clear mozilla cache files and history\n
ru: Очистка кеша и истории веб-браузера mozilla\n

source: Found mozilla cache:\n %s\n
ru: Кеш веб-браузера mozilla найден:\n %s\n

source: Do you wish to delete all mozilla cache files? ([Y]/n):
ru: Вы хотите удалить весь кеш веб-браузера mozilla? ([Y]/n):

source: Delete all mozilla cache files\n
ru: Удаление всех файлов кеша mozilla\n

source: Files have been deleted OK!\n
ru: Файлы были удалены OK!\n

source: Attention: some files were not deleted\n
ru: Внимание: некоторые файлы не удалены\n

source: Attention: Mozilla cache dir not found in user home dirs\n
ru: Внимание: кеш веб-браузера mozilla не найден в директории пользоватаеля\n

source: %s mozilla cache files have been deleted OK!\n
ru: %s файлов кеша веб-браузера mozilla были удалены OK!\n

source: Clear bash history\n
ru: Очистка истории команд bash\n

source: Found bash history files:\n %s\n
ru: Файл с ситорией команд bash найден:\n %s\n

source: Do you wish to delete all bash history files? ([Y]/n):
ru: Вы хотите удалить файлы истории команд bash? ([Y]/n):

source: Delete all bash history files\n
ru: Удаление всех файлов истории команд bash\n

source: Not faund bash history files!\n
ru: Файл с историей команд bash не найден\n
